tap "amir20/dtop"
tap "lkrms/misc"
tap "noahgorstein/tap"
tap "yannjor/krabby"
# Run your GitHub Actions locally
brew "act"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Console Matrix
brew "cmatrix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fuzzy finder with preview window for various command runners including make
brew "fzf-make"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tool for glamorous shell scripts
brew "gum"
# CLI tool to get help with CLI tools
brew "halp"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TUI playground to experiment and play with jq
brew "jqp"
# Handy way to save and run project-specific commands
brew "just"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit", link: false
# Rainbows and unicorns in your console!
brew "lolcat"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Command-line Git information tool
brew "onefetch"
# Shell command parallelization utility
brew "parallel"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Fast Git hook manager written in Rust, drop-in alternative to pre-commit
brew "prek"
# Static type checker for Python
brew "pyright"
# Repeat a command until the command succeeds
brew "retry"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Lightweight BitTorrent client
brew "transmission-cli"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Copy terminal output to clipboard
brew "yank"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord@canary"
# A terminal-based Docker container monitoring tool
cask "amir20/dtop/dtop"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Web browser focusing on security
cask "tor-browser"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Gifski", id: 1351639930
mas "HazeOver", id: 430798174
mas "Klack", id: 6446206067
mas "Numbers", id: 409203825
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bodil.prettier-toml"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidfreer.go-to-character-position"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "earshinov.permute-lines"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "josetr.cmake-language-support-vscode"
vscode "jtr.vscode-position"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "marimo-team.vscode-marimo"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "nefrob.vscode-just-syntax"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
cargo "cargo-llvm-cov"
cargo "cargo-nextest"
cargo "flamegraph"
cargo "mprocs"
cargo "prek"
cargo "repgrep"
cargo "samply"
cargo "wasm-bindgen-cli"
uv "ruff"
uv "ty"
npm "cronstrue"
npm "serve"
npm "ts-prune"
